RIET/src/InformationRegisters/ОбъектыИнформационныхБаз/ОбъектыИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыИнформационныхБаз</name>
  <resources>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/ОбъектыИнформационныхБаз/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ОбъектСозданВТекущемУзле(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыИнформационныхБаз.УзелОбмена
		|ИЗ
		|	РегистрСведений.ОбъектыИнформационныхБаз КАК ОбъектыИнформационныхБаз
		|ГДЕ
		|	ОбъектыИнформационныхБаз.Объект = &Объект";

	Запрос.УстановитьПараметр("Объект", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();
	Возврат Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УзелОбмена);
	
КонецФункции
#КонецЕсли
